In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s=pd.Series([1,2,3,np.nan,5,7])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    7.0
dtype: float64

In [14]:
dates=pd.date_range('20130101',periods=6)#创建日期
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))#以日期为索引
df

                   A         B         C         D
2013-01-01  0.836404  3.101608 -1.710913  0.787507
2013-01-02 -2.954886  0.359544 -1.134565 -1.030868
2013-01-03 -0.805961  1.531108 -1.031912  0.662581
2013-01-04  0.659747 -0.355639  1.083972  1.369274
2013-01-05 -1.253043  0.151689 -0.726938 -0.152979
2013-01-06  0.146967  0.546294  0.040920  0.245846

In [6]:
df2=pd.DataFrame({'A':1,
                'B':pd.Timestamp('20171108'),
                'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                'D':np.array([3]*4,dtype='int32'),
                 'E':pd.Categorical(['test','train','test','train']),
                 'F':'foo'})
df2

   A          B    C  D      E    F
0  1 2017-11-08  1.0  3   test  foo
1  1 2017-11-08  1.0  3  train  foo
2  1 2017-11-08  1.0  3   test  foo
3  1 2017-11-08  1.0  3  train  foo

In [9]:
df.head()
df.tail(3)

                   A         B         C         D
2013-01-04  0.659747 -0.355639  1.083972  1.369274
2013-01-05 -1.253043  0.151689 -0.726938 -0.152979
2013-01-06  0.146967  0.546294  0.040920  0.245846

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[ 0.83640434,  3.10160751, -1.7109132 ,  0.78750681],
       [-2.95488632,  0.35954437, -1.13456547, -1.03086817],
       [-0.80596062,  1.53110785, -1.03191231,  0.66258108],
       [ 0.65974693, -0.35563913,  1.08397166,  1.36927421],
       [-1.25304346,  0.15168869, -0.72693814, -0.15297886],
       [ 0.14696711,  0.54629441,  0.04092048,  0.24584614]])

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.561795  0.889101 -0.579906  0.313560
std    1.429251  1.248876  0.996661  0.835548
min   -2.954886 -0.355639 -1.710913 -1.030868
25%   -1.141273  0.203653 -1.108902 -0.053273
50%   -0.329497  0.452919 -0.879425  0.454214
75%    0.531552  1.284904 -0.151044  0.756275
max    0.836404  3.101608  1.083972  1.369274

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.836404   -2.954886   -0.805961    0.659747   -1.253043    0.146967
B    3.101608    0.359544    1.531108   -0.355639    0.151689    0.546294
C   -1.710913   -1.134565   -1.031912    1.083972   -0.726938    0.040920
D    0.787507   -1.030868    0.662581    1.369274   -0.152979    0.245846

In [19]:
df.sort_index(axis=0,ascending=False)#排序

                   A         B         C         D
2013-01-06  0.146967  0.546294  0.040920  0.245846
2013-01-05 -1.253043  0.151689 -0.726938 -0.152979
2013-01-04  0.659747 -0.355639  1.083972  1.369274
2013-01-03 -0.805961  1.531108 -1.031912  0.662581
2013-01-02 -2.954886  0.359544 -1.134565 -1.030868
2013-01-01  0.836404  3.101608 -1.710913  0.787507

In [21]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-01  0.836404  3.101608 -1.710913  0.787507
2013-01-03 -0.805961  1.531108 -1.031912  0.662581
2013-01-06  0.146967  0.546294  0.040920  0.245846
2013-01-02 -2.954886  0.359544 -1.134565 -1.030868
2013-01-05 -1.253043  0.151689 -0.726938 -0.152979
2013-01-04  0.659747 -0.355639  1.083972  1.369274

In [22]:
df['A']#getting

2013-01-01    0.836404
2013-01-02   -2.954886
2013-01-03   -0.805961
2013-01-04    0.659747
2013-01-05   -1.253043
2013-01-06    0.146967
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  0.836404  3.101608 -1.710913  0.787507
2013-01-02 -2.954886  0.359544 -1.134565 -1.030868
2013-01-03 -0.805961  1.531108 -1.031912  0.662581

In [24]:
df['20130102':'20130105']

                   A         B         C         D
2013-01-02 -2.954886  0.359544 -1.134565 -1.030868
2013-01-03 -0.805961  1.531108 -1.031912  0.662581
2013-01-04  0.659747 -0.355639  1.083972  1.369274
2013-01-05 -1.253043  0.151689 -0.726938 -0.152979

In [26]:
df.loc[dates[0]]#selection by label

A    0.836404
B    3.101608
C   -1.710913
D    0.787507
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,['A','B']]#所有行，AB两列

                   A         B
2013-01-01  0.836404  3.101608
2013-01-02 -2.954886  0.359544
2013-01-03 -0.805961  1.531108
2013-01-04  0.659747 -0.355639
2013-01-05 -1.253043  0.151689
2013-01-06  0.146967  0.546294

In [28]:
df.iloc[3]#selection by position

A    0.659747
B   -0.355639
C    1.083972
D    1.369274
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[1:3,2:4]#for slicing columns

                   C         D
2013-01-02 -1.134565 -1.030868
2013-01-03 -1.031912  0.662581

In [31]:
df.iloc[1,2]#getting a value explicity

-1.1345654727543786

In [32]:
df.iat[1,2]#getting fast

-1.1345654727543786

In [33]:
df[df.A>0]#using a single column's values to select data

                   A         B         C         D
2013-01-01  0.836404  3.101608 -1.710913  0.787507
2013-01-04  0.659747 -0.355639  1.083972  1.369274
2013-01-06  0.146967  0.546294  0.040920  0.245846

In [34]:
df[df>0]

                   A         B         C         D
2013-01-01  0.836404  3.101608       NaN  0.787507
2013-01-02       NaN  0.359544       NaN       NaN
2013-01-03       NaN  1.531108       NaN  0.662581
2013-01-04  0.659747       NaN  1.083972  1.369274
2013-01-05       NaN  0.151689       NaN       NaN
2013-01-06  0.146967  0.546294  0.040920  0.245846

In [36]:
df2=df.copy()
df2['E']=['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.836404  3.101608 -1.710913  0.787507    one
2013-01-02 -2.954886  0.359544 -1.134565 -1.030868    one
2013-01-03 -0.805961  1.531108 -1.031912  0.662581    two
2013-01-04  0.659747 -0.355639  1.083972  1.369274  three
2013-01-05 -1.253043  0.151689 -0.726938 -0.152979   four
2013-01-06  0.146967  0.546294  0.040920  0.245846  three

In [37]:
df2[df2['E'].isin(['two','four'])]#useing the isin() method for filtering(过滤)

                   A         B         C         D     E
2013-01-03 -0.805961  1.531108 -1.031912  0.662581   two
2013-01-05 -1.253043  0.151689 -0.726938 -0.152979  four

In [40]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20170220',periods=6))
s1

2017-02-20    1
2017-02-21    2
2017-02-22    3
2017-02-23    4
2017-02-24    5
2017-02-25    6
Freq: D, dtype: int64